{
  "\t": 53, 
  "\n": 24, 
  "\r": 23, 
  " ": 0, 
  "!": 128, 
  "\"": 67, 
  "#": 108, 
  "$": 80, 
  "%": 68, 
  "&": 103, 
  "'": 59, 
  "(": 50, 
  ")": 49, 
  "*": 61, 
  "+": 110, 
  ",": 19, 
  "-": 54, 
  ".": 22, 
  "/": 86, 
  "0": 27, 
  "1": 26, 
  "2": 28, 
  "3": 37, 
  "4": 39, 
  "5": 38, 
  "6": 42, 
  "7": 41, 
  "8": 40, 
  "9": 34, 
  ":": 70, 
  ";": 74, 
  "<": 293, 
  ">": 343, 
  "?": 118, 
  "A": 31, 
  "B": 52, 
  "C": 32, 
  "D": 62, 
  "E": 48, 
  "F": 43, 
  "G": 45, 
  "H": 64, 
  "I": 46, 
  "J": 71, 
  "K": 73, 
  "L": 55, 
  "M": 47, 
  "N": 60, 
  "O": 66, 
  "P": 44, 
  "Q": 77, 
  "R": 51, 
  "S": 33, 
  "T": 36, 
  "U": 58, 
  "V": 72, 
  "W": 65, 
  "X": 87, 
  "Y": 78, 
  "Z": 79, 
  "[": 29, 
  "]": 30, 
  "^": 345, 
  "a": 2, 
  "b": 20, 
  "c": 12, 
  "d": 11, 
  "e": 1, 
  "f": 15, 
  "g": 17, 
  "h": 10, 
  "i": 4, 
  "j": 63, 
  "k": 35, 
  "l": 9, 
  "m": 14, 
  "n": 5, 
  "o": 6, 
  "p": 16, 
  "q": 69, 
  "r": 7, 
  "s": 8, 
  "t": 3, 
  "u": 13, 
  "v": 25, 
  "w": 21, 
  "x": 57, 
  "y": 18, 
  "z": 56, 
  "~": 236, 
  "\u00a2": 307, 
  "\u00a3": 366, 
  "\u00a5": 245, 
  "\u00a7": 133, 
  "\u00b0": 85, 
  "\u00b1": 270, 
  "\u00b2": 142, 
  "\u00b7": 92, 
  "\u00c0": 261, 
  "\u00c1": 107, 
  "\u00c9": 101, 
  "\u00ce": 141, 
  "\u00d1": 199, 
  "\u00d3": 329, 
  "\u00d7": 356, 
  "\u00df": 194, 
  "\u00e0": 114, 
  "\u00e1": 82, 
  "\u00e2": 99, 
  "\u00e3": 106, 
  "\u00e4": 123, 
  "\u00e6": 115, 
  "\u00e7": 93, 
  "\u00e8": 94, 
  "\u00e9": 76, 
  "\u00ea": 127, 
  "\u00eb": 161, 
  "\u00ed": 81, 
  "\u00ee": 130, 
  "\u00ef": 148, 
  "\u00f1": 102, 
  "\u00f2": 221, 
  "\u00f3": 84, 
  "\u00f4": 95, 
  "\u00f5": 250, 
  "\u00f6": 91, 
  "\u00f9": 346, 
  "\u00fa": 90, 
  "\u00fb": 257, 
  "\u00fc": 89, 
  "\u00fe": 240, 
  "\u0100": 205, 
  "\u0101": 88, 
  "\u010d": 140, 
  "\u0113": 112, 
  "\u0123": 170, 
  "\u012b": 100, 
  "\u0136": 160, 
  "\u0137": 309, 
  "\u013c": 134, 
  "\u0142": 294, 
  "\u0146": 104, 
  "\u014d": 111, 
  "\u0153": 147, 
  "\u015b": 284, 
  "\u0160": 209, 
  "\u0161": 105, 
  "\u0163": 189, 
  "\u016b": 153, 
  "\u017b": 286, 
  "\u017e": 159, 
  "\u0250": 175, 
  "\u0251": 116, 
  "\u0254": 331, 
  "\u0259": 113, 
  "\u025b": 178, 
  "\u0261": 157, 
  "\u0263": 372, 
  "\u0268": 363, 
  "\u026a": 125, 
  "\u0270": 296, 
  "\u027e": 197, 
  "\u0281": 155, 
  "\u0283": 191, 
  "\u028a": 348, 
  "\u028f": 319, 
  "\u0292": 278, 
  "\u02b0": 177, 
  "\u02b2": 280, 
  "\u02be": 253, 
  "\u02bf": 326, 
  "\u02c8": 97, 
  "\u02cc": 163, 
  "\u02d0": 129, 
  "\u0301": 214, 
  "\u0303": 251, 
  "\u03b2": 259, 
  "\u0410": 158, 
  "\u0430": 224, 
  "\u0431": 237, 
  "\u0437": 243, 
  "\u0438": 203, 
  "\u043d": 252, 
  "\u0441": 238, 
  "\u0445": 220, 
  "\u044b": 227, 
  "\u044f": 217, 
  "\u0525": 254, 
  "\u0621": 380, 
  "\u0622": 229, 
  "\u0625": 210, 
  "\u0627": 109, 
  "\u0628": 173, 
  "\u0629": 182, 
  "\u062a": 138, 
  "\u062c": 151, 
  "\u062d": 288, 
  "\u062e": 156, 
  "\u062f": 222, 
  "\u0631": 149, 
  "\u0632": 186, 
  "\u0633": 215, 
  "\u0639": 310, 
  "\u0642": 344, 
  "\u0644": 124, 
  "\u0645": 139, 
  "\u0646": 248, 
  "\u0648": 174, 
  "\u0649": 184, 
  "\u064a": 208, 
  "\u0686": 378, 
  "\u06ad": 231, 
  "\u06af": 256, 
  "\u06be": 311, 
  "\u06c7": 143, 
  "\u06cc": 339, 
  "\u06d5": 274, 
  "\u0905": 364, 
  "\u0917": 305, 
  "\u091a": 358, 
  "\u091c": 179, 
  "\u0923": 349, 
  "\u0924": 246, 
  "\u0926": 255, 
  "\u0928": 230, 
  "\u092a": 359, 
  "\u092b": 211, 
  "\u092d": 298, 
  "\u092e": 324, 
  "\u092f": 381, 
  "\u0930": 207, 
  "\u0932": 292, 
  "\u0935": 369, 
  "\u0938": 233, 
  "\u093c": 218, 
  "\u093e": 185, 
  "\u093f": 198, 
  "\u0940": 165, 
  "\u0941": 260, 
  "\u0947": 312, 
  "\u094d": 162, 
  "\u0f0b": 126, 
  "\u0f40": 247, 
  "\u0f41": 370, 
  "\u0f42": 327, 
  "\u0f44": 166, 
  "\u0f50": 377, 
  "\u0f51": 371, 
  "\u0f53": 313, 
  "\u0f56": 360, 
  "\u0f58": 180, 
  "\u0f62": 334, 
  "\u0f63": 316, 
  "\u0f66": 242, 
  "\u0f67": 354, 
  "\u0f72": 225, 
  "\u0f74": 167, 
  "\u0f7c": 347, 
  "\u0f92": 336, 
  "\u0fa4": 279, 
  "\u0fad": 323, 
  "\u0fb1": 241, 
  "\u0fb2": 226, 
  "\u10d0": 119, 
  "\u10d1": 273, 
  "\u10d4": 244, 
  "\u10d6": 171, 
  "\u10d7": 213, 
  "\u10d8": 228, 
  "\u10dd": 302, 
  "\u10df": 266, 
  "\u10e1": 275, 
  "\u10e3": 333, 
  "\u10e4": 196, 
  "\u10ee": 190, 
  "\u1820": 132, 
  "\u1821": 281, 
  "\u1822": 300, 
  "\u1824": 144, 
  "\u1826": 206, 
  "\u1828": 265, 
  "\u182a": 375, 
  "\u182c": 291, 
  "\u182d": 308, 
  "\u182e": 232, 
  "\u182f": 368, 
  "\u1830": 382, 
  "\u1833": 136, 
  "\u1836": 271, 
  "\u1837": 216, 
  "\u1e25": 283, 
  "\u1e57": 340, 
  "\u200e": 193, 
  "\u2013": 75, 
  "\u2014": 83, 
  "\u2018": 321, 
  "\u2019": 117, 
  "\u201c": 172, 
  "\u201d": 181, 
  "\u2032": 131, 
  "\u2082": 304, 
  "\u20a3": 322, 
  "\u20a4": 367, 
  "\u20ac": 120, 
  "\u2212": 98, 
  "\u2265": 352, 
  "\u4e0a": 267, 
  "\u4e1c": 223, 
  "\u4e2d": 122, 
  "\u4e91": 374, 
  "\u4eac": 338, 
  "\u4eba": 169, 
  "\u5171": 164, 
  "\u5185": 355, 
  "\u522b": 176, 
  "\u5317": 168, 
  "\u533a": 121, 
  "\u534e": 192, 
  "\u5357": 152, 
  "\u53e4": 353, 
  "\u53f0": 317, 
  "\u5409": 277, 
  "\u543e": 272, 
  "\u548c": 195, 
  "\u56db": 361, 
  "\u56de": 315, 
  "\u56fd": 146, 
  "\u570b": 234, 
  "\u58ee": 306, 
  "\u590f": 379, 
  "\u5929": 337, 
  "\u5b81": 212, 
  "\u5b89": 357, 
  "\u5c14": 289, 
  "\u5c71": 239, 
  "\u5ddd": 362, 
  "\u5dde": 263, 
  "\u5e02": 145, 
  "\u5e7f": 204, 
  "\u5e86": 342, 
  "\u5efa": 287, 
  "\u5fbd": 325, 
  "\u653f": 183, 
  "\u65b0": 350, 
  "\u65cf": 219, 
  "\u6797": 341, 
  "\u6c11": 187, 
  "\u6c5f": 154, 
  "\u6cb3": 202, 
  "\u6cbb": 135, 
  "\u6d25": 297, 
  "\u6d59": 262, 
  "\u6d77": 200, 
  "\u6e2f": 258, 
  "\u6e56": 249, 
  "\u6e7e": 303, 
  "\u6fb3": 301, 
  "\u7279": 201, 
  "\u7518": 269, 
  "\u7586": 335, 
  "\u76f4": 351, 
  "\u7701": 96, 
  "\u795e": 332, 
  "\u798f": 373, 
  "\u7ef4": 264, 
  "\u8083": 318, 
  "\u81ea": 137, 
  "\u82cf": 328, 
  "\u83ef": 235, 
  "\u8499": 268, 
  "\u85cf": 314, 
  "\u884c": 188, 
  "\u897f": 150, 
  "\u8d35": 299, 
  "\u8f96": 365, 
  "\u8fbd": 276, 
  "\u91cd": 295, 
  "\u95e8": 285, 
  "\u9655": 282, 
  "\u9752": 330, 
  "\u9999": 320, 
  "\u9ed1": 376, 
  "\u9f99": 290
}